garyPenhook/PyAvrOCD/svd/attiny412.svd
        <register>
          <name>ASYNCUSER1</name>
          <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER1</name>
              <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER10</name>
          <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER10</name>
              <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER2</name>
          <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER2</name>
              <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER3</name>
          <description>Asynchronous User Ch 3 Input Selection - CCL LUT1 Event 0</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER3</name>
              <description>Asynchronous User Ch 3 Input Selection - CCL LUT1 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER4</name>
          <description>Asynchronous User Ch 4 Input Selection - CCL LUT0 Event 1</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER4</name>
              <description>Asynchronous User Ch 4 Input Selection - CCL LUT0 Event 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER5</name>
          <description>Asynchronous User Ch 5 Input Selection - CCL LUT1 Event 1</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER5</name>
              <description>Asynchronous User Ch 5 Input Selection - CCL LUT1 Event 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER6</name>
          <description>Asynchronous User Ch 6 Input Selection - TCD0 Event 0</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER6</name>
              <description>Asynchronous User Ch 6 Input Selection - TCD0 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER7</name>
          <description>Asynchronous User Ch 7 Input Selection - TCD0 Event 1</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER7</name>
              <description>Asynchronous User Ch 7 Input Selection - TCD0 Event 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER8</name>
          <description>Asynchronous User Ch 8 Input Selection - Event Out 0</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER8</name>
              <description>Asynchronous User Ch 8 Input Selection - Event Out 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER9</name>
          <description>Asynchronous User Ch 9 Input Selection - Event Out 1</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER9</name>
              <description>Asynchronous User Ch 9 Input Selection - Event Out 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
